# Taps ################################################################################################
tap "heroku/brew"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"

# Application Path ####################################################################################
cask_args appdir: "/Applications"

# Binaries/Libraries ##################################################################################
# system
brew "heroku/brew/heroku"
brew "mas"                                            # Mac App Store install support
brew "coreutils"			                                # Install GNU Core Utilities
brew "yarn"				                                    # npm replacement yarn
brew "tree"
brew "openssl@1.1"
brew "neofetch"
brew "wget"
brew "telnet"
cask "ngrok"
brew "tmux"
cask "iterm2"
brew "mackup"                                         # MacBackup
cask "karabiner-elements"
brew "svn"
# Zsh
brew "zsh"
brew "zsh-completions"
brew "fasd"
brew "fzf"
# Git
brew "git"
brew "git-flow"
brew "git-lfs"
brew "tig"
cask "sourcetree"
# NTFS
cask "osxfuse"
brew "ntfs-3g"
cask "mounty"

# Language ############################################################################################
brew "python"
brew "node" 	                                        # non-install npm
brew "ruby"                                           # Ruby
brew "jq"                                             # json
brew "java"                                           # 자바, 로그인 요구
cask "miniconda"                                      # 가상 설정, 로그인 요구

# Utils ###############################################################################################
brew "neovim"				                                  # NeoVim
brew "youtube-dl"                                     # Youtube Download Cli
brew "x264"
brew "asciinema"			                                # Terminal Record
brew "micro"
cask "itsycal"                                        # Calindar               
cask "bitwarden"                                      # 비밀번호 관리
cask "keka"                                           # 압축해제

# Database ############################################################################################
cask "db-browser-for-sqlite"

# IDE #################################################################################################
cask "pycharm-ce"
brew "visual-studio-code"
cask "intellij-idea"

# Multimedia ##########################################################################################
cask "iina"                                           # 비디오 플레이어
cask "vox"                                            # 오디오 플레이어

# Browser #############################################################################################
cask "google-chrome"

# Markdown ############################################################################################
cask "boostnote"                                      # 마크다운 노트
cask "simplenote"                                     # 노트 동기화(Win,Mac,Linux,Mobile)

# fonts ###############################################################################################
cask "font-d2coding"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-meslo-for-powerline"
cask "font-nanum-gothic"
cask "font-nanum-gothic-coding"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-noto-nerd-font"
cask "font-roboto-mono-nerd"
cask "font-ubuntu-nerd-font"
cask "font-powerline-symbols"
