tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
cask "osxfuse"
brew "openssl@1.1"
brew "asciinema"
brew "fasd"
brew "fzf"
brew "git-flow"
brew "git-lfs"
brew "jq"
brew "micro"
brew "neofetch"
brew "neovim"
brew "node@10"
brew "ntfs-3g"
brew "python"
brew "ruby"
brew "telnet"
brew "tig"
brew "tmux"
brew "tree"
brew "zsh"
brew "zsh-completions"
brew "heroku/brew/heroku"
cask "db-browser-for-sqlite"
cask "font-firacode-nerd-font"
cask "font-firamono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-noto-nerd-font"
cask "font-powerline-symbols"
cask "iterm2"
cask "mounty"
cask "ngrok"
cask "pycharm-ce"
